# Content
- Overview
- Imports
- Load the Data
- Lenght of the Time Series
- From Text to Datetime
- Setting the Index
- Setting the Desired Frequency
- Handling Missing Values

# Overview
- We will transform the DataFrame in to a Time Series
- We will learn to set any attribute of the DataFrame as Index
- We will learn to set the Frequency of the Dataset to turn it into a Time Series
- We will learn to deal with missing values in Time Series Dataset

# Imports

In [1]:
# Data Manipulation
import numpy as np
import pandas as pd

# Load the Data

In [2]:
raw_data_csv = pd.read_csv('Index2018.csv')

In [3]:
df_comp = raw_data_csv.copy()

In [4]:
df_comp.head()

         Date         spx          dax         ftse        nikkei
0  1994-01-07  469.899994  2224.949951  3446.000000  18124.009766
1  1994-01-10  475.269989  2225.000000  3440.600098  18443.439453
2  1994-01-11  474.130005  2228.100098  3413.800049  18485.250000
3  1994-01-12  474.170013  2182.060059  3372.000000  18793.880859
4  1994-01-13  472.470001  2142.370117  3360.000000  18577.259766

# Length of the Time Series

In [5]:
df_comp['Date'].describe()

count           6277
unique          6277
top       2017-09-15
freq               1
Name: Date, dtype: object

# From Text to Datetime

In [7]:
df_comp['Date'] = pd.to_datetime(df_comp['Date'], dayfirst=True,) # By default mm/dd/yyyy

In [8]:
df_comp['Date'].describe()

count                    6277
unique                   6277
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: Date, dtype: object

In [9]:
df_comp.head()

        Date         spx          dax         ftse        nikkei
0 1994-01-07  469.899994  2224.949951  3446.000000  18124.009766
1 1994-01-10  475.269989  2225.000000  3440.600098  18443.439453
2 1994-01-11  474.130005  2228.100098  3413.800049  18485.250000
3 1994-01-12  474.170013  2182.060059  3372.000000  18793.880859
4 1994-01-13  472.470001  2142.370117  3360.000000  18577.259766

# Setting the Index

In [10]:
df_comp.set_index('Date', inplace=True)

In [11]:
df_comp.head()

                   spx          dax         ftse        nikkei
Date
1994-01-07  469.899994  2224.949951  3446.000000  18124.009766
1994-01-10  475.269989  2225.000000  3440.600098  18443.439453
1994-01-11  474.130005  2228.100098  3413.800049  18485.250000
1994-01-12  474.170013  2182.060059  3372.000000  18793.880859
1994-01-13  472.470001  2142.370117  3360.000000  18577.259766

# Setting the Desired Frequency

In [15]:
df_comp = df_comp.asfreq('b') 
# We use b since our Dataset is recorded in daily basis and so we want pur frequency to be 'd' but d introduces holidays as
# which we don't want as Stock markets are open only on business days. Hence we use 'b'.
# 'h' for hourly
# 'd' for daily
# 'w' for weekly
# 'm' for montly
# 'a' for annually
# 'b' for business days
# check pandas documentation for more

In [16]:
df_comp.head()

                   spx          dax         ftse        nikkei
Date
1994-01-07  469.899994  2224.949951  3446.000000  18124.009766
1994-01-10  475.269989  2225.000000  3440.600098  18443.439453
1994-01-11  474.130005  2228.100098  3413.800049  18485.250000
1994-01-12  474.170013  2182.060059  3372.000000  18793.880859
1994-01-13  472.470001  2142.370117  3360.000000  18577.259766

# Handling Missing Values

In [20]:
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

In [21]:
# We don't have any missing value but if we had. We could to the following

In [22]:
# df_comp['spx'] = df_comp['spx'].fillna(method="ffill") # "bfill"

In [23]:
# df_comp['ftse'].fillna(value=df_comp['ftse'].mean())